app/Models/DataKecModel.php

SELECT `kategori`, `indikator`, `variabel`, `tahun`, `kecamatan`, `nilai`
FROM `tbl_data_kec`
JOIN `tbl_variabel` ON `tbl_variabel`.`id_var`=`tbl_data_kec`.`id_var`
JOIN `tbl_indikator` ON `tbl_indikator`.`id_indikator`=`tbl_variabel`.`id_indikator`
JOIN `tbl_kategori` ON `tbl_kategori`.`id_kategori`=`tbl_indikator`.`id_kategori`
JOIN `tbl_tahun` ON `tbl_tahun`.`id_tahun`=`tbl_data_kec`.`id_tahun`
JOIN `tbl_kecamatan` ON `tbl_kecamatan`.`id_kec`=`tbl_data_kec`.`id_kec`
---
    public function get_dda_kec()
    {
        $query = $this->db
            ->table('tbl_data_kec')
            // ->select('*')
            ->select('kategori, indikator, variabel, tahun, kecamatan, nilai')
            ->join('tbl_variabel', 'tbl_variabel.id_var=tbl_data_kec.id_var')
            ->join('tbl_indikator', 'tbl_indikator.id_indikator=tbl_variabel.id_indikator')
            ->join('tbl_kategori', 'tbl_kategori.id_kategori=tbl_indikator.id_kategori')
            ->join('tbl_tahun', 'tbl_tahun.id_tahun=tbl_data_kec.id_tahun')
            ->join('tbl_kecamatan', 'tbl_kecamatan.id_kec=tbl_data_kec.id_kec')
            ->get()
            ->getResultArray();

SELECT *
FROM `tbl_kategori`
ORDER BY `kategori` ASC
---
    public function get_kategori()
    {
        $query = $this->db
            ->table('tbl_kategori')
            ->orderBy('kategori', 'ASC')
            ->get()
            ->getResultArray();

SELECT *
FROM `tbl_indikator`
WHERE `id_kategori` = '5'
ORDER BY `indikator` ASC
---
    public function get_indikator($id_kategori)
    {
        $query = $this->db
            ->table('tbl_indikator')
            ->where('id_kategori', $id_kategori)
            ->orderBy('indikator', 'ASC')
            ->get()
            ->getResultArray();

SELECT *
FROM `tbl_variabel`
WHERE `id_indikator` = '25'
ORDER BY `variabel` ASC
---
    public function get_variabel($id_indikator)
    {
        $query = $this->db
            ->table('tbl_variabel')
            ->where('id_indikator', $id_indikator)
            ->orderBy('variabel', 'ASC')
            ->get()
            ->getResultArray();

SELECT *
FROM `tbl_tahun`
ORDER BY `tahun` ASC
---
    public function get_tahun()
    {
        $query = $this->db
            ->table('tbl_tahun')
            ->orderBy('tahun', 'ASC')
            ->get()
            ->getResultArray();

SELECT *
FROM `tbl_data_kec`
JOIN `tbl_kecamatan` ON `tbl_kecamatan`.`id_kec`=`tbl_data_kec`.`id_kec`
WHERE `id_var` = 1
AND `id_tahun` = 1
---
    public function get_data_kec($id_var, $id_tahun)
    {
        $array = ['id_var' => $id_var, 'id_tahun' => $id_tahun];
        // Menampilkan data berdasarkan inputan id_var dan id_tahun
        $query = $this->db
            ->table('tbl_data_kec')
            ->join('tbl_kecamatan', 'tbl_kecamatan.id_kec=tbl_data_kec.id_kec')
            ->where($array)
            ->get()
            ->getResultArray();