app/Models/DataKecModel.php

    public function get_data_kec($id_var, $id_tahun)
    {
        $array = ['id_var' => $id_var, 'id_tahun' => $id_tahun];
        // Menampilkan data berdasarkan inputan id_var dan id_tahun
        $query = $this->db
            ->table('tbl_data_kec')
            ->select('kecamatan, nilai')
            ->join('tbl_kecamatan', 'tbl_kecamatan.id_kec=tbl_data_kec.id_kec')
            ->where($array)
            ->get()
            ->getResultArray();
---
SELECT `kecamatan`, `nilai`
FROM `tbl_data_kec`
JOIN `tbl_kecamatan` ON `tbl_kecamatan`.`id_kec`=`tbl_data_kec`.`id_kec`
WHERE `id_var` = 1
AND `id_tahun` = 1